{
    "NodeVersion": "Tu versión de Node.js es muy antigua. Por favor actualiza: https://nodejs.org/en",
    "InvalidStatusCode": "Respuesta inválida. Código de estado:",
    "LatestVersion": "Última versión:",
    "OutOfDate": "El proyecto no está actualizado.",
    "UptoDate": "El proyecto está actualizado.",
    "GithubApiError": "Error de la API de GitHub:",
    "HttpGetError": "Error de HTTP GET:",
    "Error": "Error:",
    "CommandError": "Error de comando:",
    "MissingUsername": "Faltan carpetas predeterminadas porque el nombre de usuario no está configurado.",
    "ErrorFolder": "Ocurrió un error al obtener las carpetas predeterminadas.",
    "ErrorUsername": "Falló el comando echo usado para obtener el nombre de usuario.",
    "ErrorUsernameSimple": "Error al obtener el nombre de usuario:",
    "FolderDoesNotExist": "La carpeta no existe: ${folderPath}",
    "FileDoesNotExist": "El archivo no existe: ${filePath}",
    "FilesIn": "Archivos en ${folderPath}",
    "FilesDeletedSuccesfully": "Archivo eliminado con éxito: ${filePath}",
    "OpenedSuccessfully": "${toolDisplayName} abierto con éxito.",
    "ErrorOpening": "No se puede abrir ${toolDisplayName}.",
    "FileCreatedAndContentWritten": "Archivo creado y contenido escrito: ${filePath}",
    "AnErrorOccurred": "Ocurrió un error:",
    "ErrorWhileOpeningTools": "Error al abrir las herramientas:",
    "DeletingFilesInFolder": "Eliminando archivos en ${folder}",
    "ThereAreNoFilesIn": "No hay archivos para eliminar en ${folder}.",
    "ErrorHandlingFolder": "Error al manejar la carpeta ${folder}:",
    "InformationLog": "De ${files} archivos: Se detectaron ${totalFilesDeleted} archivos, ${successfulDeletions} archivos eliminados, ${unsuccessfulDeletions} archivos no se pudieron eliminar.",
    "SpotifyInformation": "Puedes ir a la aplicación de Spotify, luego a la sección 'Configuraciones' y limpiar la caché desde allí, también puedes eliminar los 'Descargados' desde la misma sección.",
    "Version": "Tu versión: V${version} | Última versión: ${latestVersion}",
    "Links": "Enlaces;",
    "formTitle": "SASPClean",
    "runButton": "Ejecutar",
    "checkDisk": "Verificar disco - Este comando examina el disco en busca de errores y los corrige automáticamente.",
    "clearWindowsUpdate": "Limpiar actualizaciones de Windows - Este comando está diseñado para eliminar archivos innecesarios y optimizar el repositorio de componentes de Windows, ayudando a liberar espacio en el sistema.",
    "diskCleaner": "Limpiador de disco - Abre la herramienta interna de limpieza de disco y permite eliminar archivos innecesarios para liberar espacio.",
    "diskCleanerSagerun": "Ejecutar limpieza rápida de disco - Ejecuta la herramienta de limpieza de disco con opciones predefinidas para eliminar archivos temporales rápidamente.",
    "dismTools": "Herramientas DISM - Con los comandos DISM puedes actualizar tu sistema, verificar su salud, reparar archivos dañados o faltantes y agregar paquetes necesarios.",
    "mdtTool": "Herramienta MDT (Herramienta de diagnóstico de memoria de Windows) - Abre la herramienta de diagnóstico de memoria de Windows para detectar y diagnosticar problemas potenciales de la memoria (RAM) de tu sistema.",
    "mrtTool": "Herramienta MRT (Herramienta de limpieza de malware de Windows) - Abre la herramienta de limpieza de malware de Windows para escanear y eliminar ciertos tipos de malware, mejorando la seguridad del sistema.",
    "fileSystemCheck": "Verificación de integridad del sistema de archivos - Ejecuta el Comprobador de Archivos del Sistema para verificar y reparar los problemas que detecte en los archivos del sistema.",
    "windowsExperienceIndex": "Evaluación del índice de experiencia de Windows - Inicia la evaluación del índice de experiencia de Windows para proporcionar una evaluación detallada del rendimiento de tu sistema, tanto en hardware como en software.",
    "upgradePackages": "Actualizar controladores y aplicaciones - Actualiza todas las aplicaciones instaladas con Chocolatey y Winget a la última versión con nuevas características y correcciones de seguridad.",
    "checkWinUpdate": "Verificar actualizaciones de Windows - Verifica las últimas actualizaciones de Windows y agrega los parches e mejoras necesarios a tu sistema.",
    "checkHacked": "Verificar si el sistema ha sido hackeado - Verifica si hay violaciones de seguridad en tu sistema.",
    "performanceHigh": "Alto rendimiento - Abre la sección de 'Opciones de energía' y selecciona alto rendimiento.",
    "gameMode": "Modo de juego - Abre la sección de 'Configuración de modo de juego' y activa el 'modo de juego'.",
    "performanceOptions": "Opciones de rendimiento y optimización de rendimiento - Abre la sección de 'Configuraciones de apariencia' y activa/desactiva según prefieras. Mi recomendación es revisar el archivo 'README.md' en GitHub.",
    "systemInfo": "Información del sistema - Muestra la información del sistema.",
    "initiateFileCleanup": "Iniciar limpieza de archivos - Elimina ciertos archivos, incluidos los de los directorios Prefetch, Temp y %temp%, para liberar espacio y eliminar archivos temporales innecesarios.",
    "exitMessage": "¿Estás seguro de que quieres salir?",
    "exitTitle": "Confirmación de salida",
    "chocolateyNotFound": "Chocolatey no está instalado.",
    "chocolateyInstalled": "Chocolatey está instalado.",
    "loadingScreen": {
      "title": "Pantalla de carga de SASPClean",
      "checkingUpdates": "Verificando actualizaciones..."
    },
    "errorMessages": {
      "folderNotFound": "Error: No se pudo encontrar la carpeta 'icon'.",
      "fileNotFound": "Error: No se pudo encontrar el archivo 'icon\\SASPClean.png'.",
      "packageJsonNotFound": "Error: No se pudo encontrar el archivo 'package.json'."
    },
    "updateMessages": {
      "newVersionAvailable": "¡Nueva versión disponible! ¿Te gustaría ver la publicación?",
      "updateAvailable": "Actualización disponible",
      "updateChoice": {
        "yes": "Sí",
        "no": "No"
      }
    }
  }
  